In [41]:
import pymysql
import pandas as pd
myconnection = pymysql.connect(host='127.0.0.1',user='root',passwd='Krisrak@123')
query = "Select * from dataspark_global_electronics.merged_df;"
pd.set_option('display.max_columns', None)
df = pd.read_sql(query,myconnection)
df.head(1)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\150217140.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,myconnection)

,order_number,line_item,order_date,delivery_date,customerkey,storekey,productkey,quantity,currency_code,gender,name,city,state_code,state,zip_code,country,continent,birthday,age,country_store,state_store,square_meters,open_date,product_name,brand,color,unit_cost_usd,unit_price_usd,subcategorykey,subcategory,categorykey,category,date,currency,exchange
0,366000,1,2016-01-01,2016-01-05,265598,10,1304,1,CAD,MALE,TYLER VAUGHT,LONDON,ON,ONTARIO,N5W 5K6,CANADA,NORTH AMERICA,1971-03-23,53,CANADA,NUNAVUT,1210.0,2015-04-04,CONTOSO LENS ADAPTER M450 WHITE,CONTOSO,WHITE,31.27,68.0,406,CAMERAS & CAMCORDERS ACCESSORIES,4,CAMERAS AND CAMCORDERS,2016-01-01,CAD,1.3884

# SQL Queries based on Customer, Sales, Product, Store category

In [27]:
Gender_Distribution = """
    SELECT gender, COUNT(DISTINCT customerkey) AS distinct_count
    FROM dataspark_global_electronics.merged_df
    GROUP BY gender;
"""
df = pd.read_sql(Gender_Distribution,myconnection)
df

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\1933971581.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Gender_Distribution,myconnection)

   gender  distinct_count
0  FEMALE            5858
1    MALE            6029

In [42]:
Age_Distribution = """
    SELECT 
        age, 
        COUNT(DISTINCT customerkey) AS age_count
    FROM 
        dataspark_global_electronics.merged_df
    GROUP BY 
        age
    ORDER BY 
        age;
"""
df = pd.read_sql(Age_Distribution,myconnection)
df

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\4011642493.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Age_Distribution,myconnection)

    age  age_count
0    22         47
1    23        208
2    24        200
3    25        175
4    26        177
..  ...        ...
63   85        156
64   86        170
65   87        203
66   88        160
67   89        122

[68 rows x 2 columns]

In [29]:
Location_Distribution = """SELECT country, COUNT(DISTINCT customerkey) AS count
FROM dataspark_global_electronics.merged_df
GROUP BY country
ORDER BY count DESC;
"""
df = pd.read_sql(Location_Distribution,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\2649614041.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Location_Distribution,myconnection)

          country  count
0   UNITED STATES   5706
1  UNITED KINGDOM   1570
2          CANADA   1179

In [30]:
Preferred_Products = """
    SELECT 
        product_name, 
        COUNT(*) AS purchase_count
    FROM 
        dataspark_global_electronics.merged_df
    GROUP BY 
        product_name
    ORDER BY 
        purchase_count DESC
    LIMIT 3;  -- Limit to top 3 results directly in SQL for efficiency
"""
df = pd.read_sql(Preferred_Products,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\3442366239.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Preferred_Products,myconnection)

                                 product_name  purchase_count
0  ADVENTURE WORKS DESKTOP PC2.30 MD230 BLACK             162
1  ADVENTURE WORKS DESKTOP PC2.30 MD230 WHITE             158
2              WWI DESKTOP PC1.60 E1600 BLACK             158

In [31]:
age_Segmentation = """
SELECT 
    CASE
        WHEN age BETWEEN 18 AND 25 THEN '18-25'
        WHEN age BETWEEN 26 AND 35 THEN '26-35'
        WHEN age BETWEEN 36 AND 45 THEN '36-45'
        WHEN age BETWEEN 46 AND 55 THEN '46-55'
        WHEN age > 55 THEN '55+'
        ELSE 'Unknown' -- Optional: Handle cases where age might be NULL or not fit the specified ranges
    END AS age_group,
    COUNT(DISTINCT customerkey) AS count
FROM dataspark_global_electronics.merged_df
GROUP BY age_group
ORDER BY count DESC;
"""
df = pd.read_sql(age_Segmentation,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\3231669511.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(age_Segmentation,myconnection)

  age_group  count
0       55+   5957
1     36-45   1800
2     26-35   1754

In [32]:
Frequency_of_Purchases = """
SELECT customerkey, COUNT(order_number) AS purchase_frequency
FROM dataspark_global_electronics.merged_df
GROUP BY customerkey
ORDER BY purchase_frequency DESC;
"""
df = pd.read_sql(Frequency_of_Purchases,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\1403107962.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Frequency_of_Purchases,myconnection)

   customerkey  purchase_frequency
0       723572                  36
1      1925694                  32
2      1579183                  32

In [33]:
Total_Sales = """SELECT DATE_FORMAT(order_date, '%Y-%m') AS month, SUM(unit_price_usd) AS total_sales
FROM dataspark_global_electronics.merged_df
GROUP BY month
ORDER BY month;
"""
df = pd.read_sql(Total_Sales,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\1795721160.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Total_Sales,myconnection)

     month    total_sales
0  2016-01  201820.149564
1  2016-02  262513.239565
2  2016-03  100640.149788

In [34]:
Top_Performing_Products_Quantity = """SELECT product_name, SUM(quantity) AS total_quantity_sold, SUM(unit_price_usd) AS total_price
FROM dataspark_global_electronics.merged_df
GROUP BY product_name
ORDER BY total_quantity_sold DESC
LIMIT 10;
"""
df = pd.read_sql(Top_Performing_Products_Quantity,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\3696275472.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Top_Performing_Products_Quantity,myconnection)

,product_name,total_quantity_sold,total_price
0,WWI DESKTOP PC2.33 X2330 BLACK,550.0,141526.000000
1,WWI DESKTOP PC1.80 E1800 WHITE,538.0,36324.199036
2,ADVENTURE WORKS DESKTOP PC1.60 ED160 BLACK,521.0,41842.251892

In [35]:
Top_Performing_Products_Revenue = """
    WITH RevenueSummary AS (
        SELECT product_name, SUM(unit_price_usd) AS total_revenue
        FROM dataspark_global_electronics.merged_df
        GROUP BY product_name
    )
    SELECT product_name, total_revenue
    FROM RevenueSummary
    ORDER BY total_revenue DESC
    LIMIT 10;
    """
df = pd.read_sql(Top_Performing_Products_Revenue,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\739355655.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Top_Performing_Products_Revenue,myconnection)

                                  product_name  total_revenue
0   ADVENTURE WORKS DESKTOP PC2.33 XD233 BLACK       146319.0
1               WWI DESKTOP PC2.33 X2330 BLACK       141526.0
2  ADVENTURE WORKS DESKTOP PC2.33 XD233 SILVER       141474.0

In [36]:
Average_Order_Value = """SELECT AVG(unit_price_usd) AS avg_order_value FROM dataspark_global_electronics.merged_df;"""
df_avg_order_value = pd.read_sql(Average_Order_Value, myconnection)
print(df_avg_order_value)

   avg_order_value
0       280.569848

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\402551151.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_avg_order_value = pd.read_sql(Average_Order_Value, myconnection)

In [37]:
Profit_Margins_for_Products = """SELECT product_name, (unit_price_usd - unit_cost_usd) AS profit_margin
FROM dataspark_global_electronics.merged_df
ORDER BY profit_margin DESC
LIMIT 10;

"""
df = pd.read_sql(Profit_Margins_for_Products,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\150342600.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Profit_Margins_for_Products,myconnection)

                                 product_name  profit_margin
0  FABRIKAM REFRIGERATOR 24.7CUFT X9800 GREEN     2139.77002
1     LITWARE REFRIGERATOR 24.7CUFT X980 GREY     2139.77002
2   FABRIKAM REFRIGERATOR 24.7CUFT X9800 GREY     2139.77002

In [38]:
Sales_by_Store = """SELECT storekey, 
       SUM(unit_price_usd) AS total_sales_price,
       COUNT(order_number) AS total_orders
FROM dataspark_global_electronics.merged_df
GROUP BY storekey
ORDER BY total_sales_price DESC;
"""
df = pd.read_sql(Sales_by_Store,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\4144723826.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Sales_by_Store,myconnection)

   storekey  total_sales_price  total_orders
0         0       3.626168e+06         13165
1        54       4.438459e+05          1498
2        55       4.381089e+05          1518

In [39]:
Category_Analysis = """SELECT category, 
       SUM(quantity) AS total_quantity_sold,
       SUM(unit_price_usd) AS total_revenue
FROM dataspark_global_electronics.merged_df
GROUP BY category
ORDER BY total_revenue DESC;
"""
df = pd.read_sql(Category_Analysis,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_28648\3490705474.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Category_Analysis,myconnection)

                 category  total_quantity_sold  total_revenue
0               COMPUTERS              44151.0   6.083930e+06
1         HOME APPLIANCES              18401.0   3.392752e+06
2  CAMERAS AND CAMCORDERS              17609.0   2.066737e+06